# SplitFacesByGroundPlaneCrashed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..SplitFacesByGroundPlaneCrashed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to split face by ground plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SplitFacesByGroundPlaneCrashed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SplitFacesByGroundPlaneCrashed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SplitFacesByGroundPlaneCrashed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace